<!DOCTYPE html>
<html lang="en">
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<style type="text/css">
    body {
        font-family: 'nikosh', Poppins, sans-serif;
       
    }

    .head_title_acc {
        font-size: 20px;
        line-height: 37px;
        margin-bottom: 0px;
    }

    .main {
        float: left;
        padding-top: 50px;
        padding-left: 700px;
        padding-right: 25px;
    }

    .subject {
        font-size: 20px;
        margin-top: 25px;
    }

    .header_content_acc {
        font-size: 20px;
        margin-top: 15px;
        line-height: 41px;
        /* margin-bottom: 15px; */
        text-align: justify;
        text-indent: 60px;
    }

    .mohdoy {
        font-size: 20px;
        margin-top: 25px;
    }

    table thead tr th {
        border-right: 1px solid #000000;
        border-bottom: 1px solid #000000;
        border-top: 1px solid #000000;
    }

    table thead tr:first-child {
        border-left: 1px solid #000000;
    }

    table tbody tr:last-child {
        border-right: 1px solid #000000;
        border-left: 1px solid #000000;
        border-bottom: 1px solid #000000;
    }
  
  /* as */
  .center {
  margin: 0 auto;
  background-color: seagreen;
  padding-top: 250px;
}

.right, .center {
  width: 290px;
  height: 150px;
  text-align:center;
  font-size: 20px;        
  line-height: 37px;
  margin-top: 70px;
  /* background:red; */
}

.right {
  float: right;
}

 /* */

    .text-center {
        text-align: center;
    }

    .pdding-text {
        padding-left: 55px;
    }
    /* header 3 div */
    /* Create three equal columns that floats next to each other */
.column {
  float: left;
  width: 29.33%;
  padding: 10px;
  height: auto; /* Should be removed. Only for demonstration */
}

/* Clear floats after the columns */
.row:after {
  content: "";
  display: table;
  clear: both;
}
</style>

<body>
    {{-- <div class="header_section" style="text-align:center;">
        {!! $acc_head !!}
    </div> --}}
<div class="main" >
    <table  style="width: 100%;">
            <tr>
              <td style="text-align: right; font-size: 21px;">বাংলাদেশ জাতীয় সংসদ সচিবালয় <b style="color:white;">>afsdh</b></td>
              <td rowspan=2  style="text-align: center;">  
                  <img src="{{asset('public/backend/jpm.jpg')}}" width="80px"> </td>
            </tr>
            <tr>
              <td style="text-align: right; font-size: 21px;">সদস্য ভবন শাখা <b style="color:white;">>afsdafasdfd</b></td>
            </tr>
    </table>

    <table  style="width: 100%;">
        <tr>
      <td colspan=2  style="text-align: center;">  <u>www.parliament.gov.bd<u></td>
        </tr>
       <tr>
            <td style="font-size: 21px; ">     </td>
            <td  style="text-align: right;">  <p>১৪ শ্রাবণ ১৪২৭<br>                 তারিখঃ                                 
              ২৯ জুলাই ২০২০</h4></p></td>
          </tr>
</table>
   
 </div>
 <div style="font-size: 21px; "> নম্বর-...............................
</div>
    <div class="head_title_acc">প্রাপক,
        <br>
        <div class="pdding-text"> জনাব ... {{ $app_data[0]->p_name_bn }}
            <br>
            মাননীয় সংসদ-সদস্য
            <br>
            {{ $app_data[0]->number. ' '. $app_data[0]->con_bn_name}}
            <br>
            বাংলাদেশ জাতীয় সংসদ, ঢাকা।
        </div>
        </div>
    <div class="subject">বিষয়ঃ-  বাংলাদেশ জাতীয় সংসদ সচিবালয়ের আওতাধীন {{$app_data[0]->ar_name_bn}} সংসদ-সদস্য ভবনের ফ্ল্যাট বরাদ্দ।।</div><br>
    <div class="mohdoy">মহোদয়,</div>
    <div class="header_content_acc"> 
        যথাযথ সম্মানের সঙ্গে জানাচ্ছি যে, আপনার আবেদনের পরিপ্রেক্ষিতে {{$app_data[0]->ar_name_bn}} {{ $app_data[0]->acb_name_bn.' '.$app_data[0]->fl_name_bn.' '.$app_data[0]->f_number_bn }} নং ফ্ল্যাটের বরাদ্দ বাতিল করে মানিক মিয়া অ্যাভিনিউস্থ ০৩ 
        নং সংসদ-সদস্য ভবনের ৭০৪ নং ফ্ল্যাটটি (১২৫০ বর্গফুট) নিম্নবর্ণিত শর্তে আপনার নামে নির্দেশক্রমে প্রদান করা হলো।
      
  </div>

<h2>২। শ্রতাবলি/নিয়মাবলীঃ </h2>
<p style="font-size: 21px; line-height: 41px;">
    ১। 	ফ্ল্যাট বরাদ্দ পাওয়ার পর ফ্ল্যাটে সরবরাহকৃত সরকারি মালামালসহ ফ্ল্যাটের দখলভার সংশ্লিষ্ট কেয়ারটেকারের নিকট হতে বুঝে নিতে হবে এবং ফ্ল্যাট ছেড়ে দেয়ার সময় সরবরাহকৃত সরকারি মালামালসহ ফ্ল্যাটের দখলভার সংশ্লিষ্ট কেয়ারটেকারের নিকট হতে বুঝিয়ে দিতে হবে;<br>
    ২। 	বরাদ্দকৃত ফ্ল্যাটে মাননীয় সংসদ-সদস্য যদি ব্যক্তিগত কোন আসবাবপত্র  অথবা অন্য কোন মালামাল ব্যবহার করেন তাহলে উক্ত আসবাবপত্র/মালামালের তালিকা সম্পর্কে ভবন শাখাকে লিখিতভাবে অবহিত করতে হবে এবং ফ্ল্যাট ছেড়ে দেয়ার সময় উক্ত আসবাবপত্র/মালামাল সংশ্লিষ্ট কেয়ারটেকারের নিকট রক্ষিত রেজিষ্টারে লিপিবদ্ধ করে ছাড়পত্র গ্রহণ করতে হবে ।  <br>                    
    ৩। 	বরাদ্দপত্র জারির এক মাসের মধ্যে ফ্ল্যাটের দখলভার বুঝে নিতে হবে । অন্যথায় এ বরাদ্দপত্র বাতিল বলে গন্য হবে; <br>
    ৪। 	বরাদ্দকৃত ফ্ল্যাটে স্ত্রী/ স্বামী, ছেলে-মেয়ে, বাবা-মা, শশুড়-শাশুড়ী ও পরিবার ব্যতিত অন্য কেঊ অবস্থান করতে পারবেন না। এর ব্যত্যয় হলে ফ্ল্যাটের বরাদ্দপত্র বাতিল বলে গণ্য হবে।  <br>
    ৫।	১৮০০ বর্গফুট ফ্ল্যাটের জন্য মাসিক ৬০০/- (...............) টাকা এবং ১২৬০ ও ১২৫০  বর্গফুট ফ্ল্যাটের জন্য মাসিক ৪০০/- (............) টাকা সার্ভিস চার্জ প্রদান করতে হবে । এ সার্ভিস চার্জ মাননীয় সংসদ-সদস্যগণের প্রাপ্য মাসিক পারিতোষিক ও ভাতার বিল হতে কর্তন করা হবে। <br>
    ৬।	যদি কোন মাননীয় মন্ত্রী/প্রতিমন্ত্রী/ উপমন্ত্রী অথবা সমপদমর্যাদা সম্পন্ন কেউ সংসদ-সদস্য ভবনসমূহের ফ্ল্যাটে বসবাস করতে আগ্রহী হন তাহলে তিনি সরকার থেকে যে বাড়ি ভাড়া প্রাপ্য হবেন তার সম্পূর্ণ অংশ সংসদ-সদস্য ভবনের ফ্ল্যাটের ভাড়া বাবদ তার পারিতোষিক ও ভাতাদি হতে কর্তন করার জন্য সংশ্লিষ্ট মন্ত্রণালয়ে পত্র প্রেরণ করা হবে।<br>
    ৭।	মাননীয় সংসদ-সদস্যের মেয়াদ পূর্তিতে অথবা  সংসদ-সদস্যের পদ শূন্য হলে ফ্ল্যাটের বরাদ্দ বাতিল বলে গণ্য হবে এবং পরবর্তী ৯০ দিনের মধ্যে সদস্য ভবন শাখার অনুকূলে ফ্ল্যাটের দখলভার বুঝিয়ে দিতে হবে । অন্যথায় পরবর্তী প্রতিমাসের জন্য ফ্ল্যাটের ভাড়া বাবদ মাননীয় উপমন্ত্রী প্রাপ্য সরকারী বাড়ী ভাড়ার ন্যায় ৭০০০০/- (সত্তর হাজার) টাকা করে তার পারিতোষিক ও ভাতাদি থেকে কর্তন করা হবে ।<br>
    ৮। 	মাননীয় সংসদ-সদস্যে অথবা তার পরিবারের সদস্যদের সাথে কেউ সাক্ষাত করতে চাইলে মাননীয় সংসদ-সদস্যের অনুমতিক্রমে সংশ্লিষ্ট অভরথনাকারীর নিকট থেকে গেট পাস সংগ্রহ করে  সংসদ-সদস্যে ভবনের ফ্ল্যাটে প্রবেশ করতে হবে;<br>
    ৯। 	যে সকল মাননীয় সংসদ-সদস্যের ঢাকায় নিজস্ব বাড়ি/ ফ্ল্যাট নেই, ফ্ল্যাট বরাদ্দের ক্ষেত্রে তারা অগ্রাধিকার পাবেন;<br>	
    ১০।	ফ্ল্যাটে বিদ্যুতের/গ্যাসের প্রি-পেইড মিটার স্থাপন করা হলে নিজেদেরকে বিদ্যুৎ ও গ্যাসের বিল পরিশোধ করতে হবে;<br>	
    ১১। ফ্ল্যাট বরাদ্দের শর্তাবলী যথাযথভাবে পালন করতে হবে ;<br>	
    ১২। ফ্ল্যাট বরাদ্দ, পুনঃ বরাদ্দ, বাতিল ও পরিবর্তনের ক্ষমতা কর্তৃপক্ষ সংরক্ষণ করেন এবং এ বিষয়ে কর্তৃপক্ষের সিদ্ধান্ত চূড়ান্ত বলে গণ্য হবে;<br>	
</p>

  
<br><br>
  <div class="left"  style=" font-size: 19px; height: 800px;">
    আপনার বিশ্বস্ত, <br><br>
   
</div> 
<p style="text-align: center;">-2-</p>
<br><br>
<table  style="width: 100%;">
 <tr>
        <td style="font-size: 21px; "> </td>
        <td  style="text-align: right;">  <p>১৪ শ্রাবণ ১৪২৭<br>                 তারিখঃ                                 
          ২৯ জুলাই ২০২০</h4></p></td>
      </tr>
</table>
<table  style="width: 100%;">
<tr>
    <td style="font-size: 21px; "> নম্বর-...............................</td>
</table>


<h2>সদয় অবগতি ও কার্যার্থেঃ </h2>
<p style="font-size: 21px; line-height: 41px;">
    ১। 	জনাব বদরুদ্দোজা মোঃ ফরহাদ হোসেন, মাননীয় সংসদ-সদস্যে, ২৪৩ বি-বাড়ীয়া-১, বাংলাদেশ জাতীয় সংসদ, ঢাকা । তাকে নাখালপাড়াস্থ ৪ নং সংসদ-সদস্য ভবনের ৩০৩ নং ফ্ল্যাটটি বুঝিয়ে দিয়ে মানিক মিয়া অ্যাভিনিউস্থ ০৩ নং সংসদ-সদস্য ভবনের ৭০৪ নং ফ্ল্যাটটি বুঝে নেয়ার  জন্য সবিনয় অনুরোধ করা হলো ।<br>
    ২। 	মাননীয় স্পীকার মহোদয়ের একান্ত সচিব, বাংলাদেশ জাতীয় সংসদ, ঢাকা।<br>                    
    ৩। 	মাননীয় চীপ হুইপ মহোদয়ের একান্ত সচিব, বাংলাদেশ জাতীয় সংসদ সচিবালয়, ঢাকা।<br>
    ৪। 	সিনিয়র সচিব মহোদয়ের একান্ত সচিব, বাংলাদেশ জাতীয় সংসদ সচিবালয়, ঢাকা।<br>
    ৫। 	নির্বাহী প্রকৌশলী, গণপূর্ত বিভাগ-১, শেরেবাংলা নগর, ঢাকা।<br>
    ৬। 	নির্বাহী প্রকৌশলী, গণপূর্ত ই/এম, কারখনা বিভাগ শেরেবাংলা নগর, ঢাকা।<br>
    ৭।	সিনিয়র সহকারী সচিব, সেবা শাখা, বাংলাদেশ জাতীয় সংসদ সচিবালয়, ঢাকা। তাকে ফ্ল্যাটটিতে পিএবিএক্স টেলিফোন (যদি না থাকে) সংযোগ প্রদানের প্রয়োজনীয় ব্যবস্থা গ্রহনের জন্য নির্দেশক্রমে অনুরোধ করা হলো।<br>
    ৮।	উপ-বিভাগীয় প্রকৌশলী-১ ও ২, গণপূর্ত বিভাগ-১, শেরেবাংলা নগর, ঢাকা।<br>
    ৯।	নিরীক্ষ ও হিসাবরক্ষণ কর্মকর্তা, অডিট ইউনিট, বাংলাদেশ জাতীয় সংসদ সচিবালয়, ঢাকা। তাকে পূর্ব পৃষ্ঠার ৪ নং শর্তের আলোকে মাননীয় সংসদ-সদস্যের পারিতোষিক ও ভাতার বিল থেকে সার্ভিস চার্জ কর্তন করার প্রয়োজনীয় ব্যবস্থা গ্রহনের জন্য নির্দেশক্রমে অনুরোধ করা হলো।<br>	
    ১০।	সহকারী সচিব, অর্থ শাখা-২, বাংলাদেশ জাতীয় সংসদ সচিবালয়, ঢাকা।<br>	
    ১১।	অতিরিক্ত সচিব (এ, এস) মহোদয়ের ব্যক্তিগত কর্মকর্তা, বাংলাদেশ জাতীয় সংসদ সচিবালয়, ঢাকা।<br>	
    ১২।	যুগ্ম-সচিব (প্রশাসন-২)মহোদয়েরব্যক্তিগত কর্মকর্তা, বাংলাদেশ জাতীয় সংসদ সচিবালয়, ঢাকা।<br>	
    ১৩।	কেয়ারটেকার, মানিক মিয়া অ্যাভিনিউস্থ ১-৩ নম্বর নং সংসদ-সদস্য ভবন, ঢাকা। বরাদ্দ প্রাপককে ফ্ল্যাটটি বুঝিয়ে দেয়ার জন্য নির্দেশক্রমে অনুরোধ করা হলো।<br>
১৪। কেয়ারটেকার নাখালপাড়া সংসদ-সদস্য ভবন, ঢকা। তাকে ৪ নং ভবনের ৩০৩ নং ফ্ল্যাটটি বুঝে নিয়ে সংসদ ভবন শাখাকে অবহিত করার জন্য অনুরোধ করা হলো।<br>
১৫।	রেকর্ড ।
</p>
    <div class="outer">
        <div class="right">
            (আবদুর রহমান) <br>
            সিনিয়র সহকারী সচিব <br>
        </div>    
     </div> 
    </div>
</body>
</html>
