<?php
/**
 * Author: Rajan Bhatta
 * Date: 28/01/2021
 */

use App\Model\ParliamentRule;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ParliamentRuleSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $datas = [
            [
                'id' => 1,
                'rule_number' => '164',
                'name' => 'কার্যপ্রণালী বিধির ১৬৪ বিধি অনুসারে বিশেষ অধিকার প্রশ্নের নোটিশ',
                'description' => 'কার্যপ্রণালী বিধির ১৬৪ বিধি অনুসারে বিশেষ অধিকার প্রশ্নের নোটিশ',
                'department_id' => 1,
                'created_by' => 1
            ],[
                'id' => 2,
                'rule_number' => '147',
                'name' => 'কার্যপ্রণালী বিধির ১৪৭ বিধি অনুযায়ী প্রস্তাব (সাধারণ) এর আলোচনা প্রসঙ্গে',
                'description' => 'কার্যপ্রণালী বিধির ১৪৭ বিধি অনুযায়ী প্রস্তাব (সাধারণ) এর আলোচনা প্রসঙ্গে',
                'department_id' => 3,
                'created_by' => 1
            ],[
                'id' => 3,
                'rule_number' => '131',
                'name' => 'কার্যপ্রণালী বিধির ১৩১ বিধি অনুসারে সিদ্ধান্ত প্রস্তাব',
                'description' => 'কার্যপ্রণালী বিধির ১৩১ বিধি অনুসারে সিদ্ধান্ত প্রস্তাব',
                'department_id' => 5,
                'created_by' => 1
            ],[
                'id' => 4,
                'rule_number' => '118',
                'name' => 'কার্যপ্রণালী বিধির ১১৮ বিধি অনুসারে ছাঁটাই প্রস্তাব',
                'description' => 'কার্যপ্রণালী বিধির ১১৮ বিধি অনুসারে ছাঁটাই প্রস্তাব',
                'department_id' => 1,
                'created_by' => 1
            ],[
                'id' => 5,
                'rule_number' => '102',
                'name' => 'কার্যপ্রণালী বিধির ১০২ বিধি অনুসারে পিটিশনের নোটিশ',
                'description' => 'কার্যপ্রণালী বিধির ১০২ বিধি অনুসারে পিটিশনের নোটিশ',
                'department_id' => 1,
                'created_by' => 1
            ],[
                'id' => 6,
                'rule_number' => '82',
                'name' => 'কার্যপ্রণালী বিধির ৮২ বিধি অনুসারে বিলের দফা সংশোধনীর নোটিশ',
                'description' => 'কার্যপ্রণালী বিধির ৮২ বিধি অনুসারে বিলের দফা সংশোধনীর নোটিশ',
                'department_id' => 4,
                'created_by' => 1
            ],[
                'id' => 7,
                'rule_number' => '78',
                'name' => 'কার্যপ্রণালী বিধির ৭৮ বিধি অনুসারে বিলের সংশোধনীর নোটিশ',
                'description' => 'কার্যপ্রণালী বিধির ৭৮ বিধি অনুসারে বিলের সংশোধনীর নোটিশ',
                'department_id' => 4,
                'created_by' => 1
            ],[
                'id' => 8,
                'rule_number' => '71',
                'name' => 'কার্যপ্রণালী বিধির ৭১ বিধি অনুসারে জরুরি জন-গুরুত্বসম্পন্ন বিষয় সম্পর্কে মনোযোগ আকর্ষণের নোটিশ',
                'description' => 'কার্যপ্রণালী বিধির ৭১ বিধি অনুসারে জরুরি জন-গুরুত্বসম্পন্ন বিষয় সম্পর্কে মনোযোগ আকর্ষণের নোটিশ',
                'department_id' => 3,
                'created_by' => 1
            ],[
                'id' => 9,
                'rule_number' => '68',
                'name' => 'কার্যপ্রণালী বিধির ৬৮ বিধি অনুসারে জরুরি জন-গুরুত্বসম্পন্ন বিষয় সম্পর্কে সাম্প্রতিক আলোচনা',
                'description' => 'কার্যপ্রণালী বিধির ৬৮ বিধি অনুসারে জরুরি জন গুরুত্বসম্পন্ন বিষয় সম্পর্কে সাম্প্রতিক আলোচনা',
                'department_id' => 3,
                'created_by' => 1
            ],[
                'id' => 10,
                'rule_number' => '62',
                'name' => 'কার্যপ্রণালী বিধির ৬২ বিধি অনুসারে জন-গুরুত্বসম্পন্ন  বিষয়ে সংসদে মুলতবি প্রস্তাব উত্থাপনের নোটিশ',
                'description' => 'কার্যপ্রণালী বিধির ৬২ বিধি অনুসারে জন-গুরুত্বসম্পন্ন  বিষয়ে সংসদে মুলতবি প্রস্তাব উত্থাপনের নোটিশ',
                'department_id' => 3,
                'created_by' => 1
           ],[
                'id' => 11,
                'rule_number' => '60',
                'name' => 'কার্যপ্রণালী বিধির ৬০ বিধি অনুসারে অর্ধ-ঘন্টা আলোচনার জন্য নোটিশ',
                'description' => 'কার্যপ্রণালী বিধির ৬০ বিধি অনুসারে অর্ধ-ঘন্টা আলোচনার জন্য নোটিশ',
                'department_id' => 3,
                'created_by' => 1
           ],[
                'id' => 12,
                'rule_number' => '59',
                'name' => 'কার্যপ্রণালী বিধির ৫৯ বিধি অনুসারে স্বল্পকাল নোটিশে / প্রশ্ন উত্থাপনের নোটিশ',
                'description' => 'কার্যপ্রণালী বিধির ৫৯ বিধি অনুসারে স্বল্পকাল নোটিশে / প্রশ্ন উত্থাপনের নোটিশ',
                'department_id' => 6,
                'created_by' => 1
           ],[
                'id' => 13,
                'rule_number' => '42',
                'name' => 'কার্যপ্রণালী বিধির ৪২ বিধি অনুসারে প্রশ্ন উত্থাপনের নোটিশ',
                'description' => 'কার্যপ্রণালী বিধির ৪২ বিধি অনুসারে প্রশ্ন উত্থাপনের নোটিশ',
                'department_id' => 6,
                'created_by' => 1
           ]
        ];

        foreach ($datas as $key => $data) {
            $old = ParliamentRule::where('id', $data['id'])->first();
            if (!$old) {
                ParliamentRule::create($data);
            }
        }
        // DB::table('rules')->insert($data);
    }
}
